app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "soju"], ["text", "hello world"], ["created_at", "2015-09-30 19:30:49.727072"], ["updated_at", "2015-09-30 19:30:49.727072"]]